import { CategoryItem } from '../../types';
import Img1 from "../../assets/category-images/covid19-category/img1.jpeg"
import Img2 from "../../assets/category-images/covid19-category/img2.jpeg"
import Img3 from "../../assets/category-images/covid19-category/img3.jpeg"
import Img4 from "../../assets/category-images/covid19-category/img4.png"
import Img5 from "../../assets/category-images/covid19-category/img5.jpeg"
import Img6 from "../../assets/category-images/covid19-category/img6.jpeg"
import Img7 from "../../assets/category-images/covid19-category/img7.png"
import Img8 from "../../assets/category-images/covid19-category/img8.jpeg"

import MainImg1 from '../../assets/category-images/main-category/main-bacII/main-img1.jpeg'
import MainImg2 from '../../assets/category-images/main-category/main-bacII/main-img2.png'

export const bacIICategoryData: CategoryItem[] = [
    {
        image: Img1,
        title: "ផ្លូវការហើយ! ក្រសួងកំណត់យកថ្ងៃទី ២៧ ខែធ្នូ ជាថ្ងៃប្រឡងបាក់ឌុបទូទាំងប្រទេស ឯទម្រង់ប្រឡងដូចរាល់ឆ្នាំគ្មានប្ដូរ",
        des: "ផ្លូវការហើយ! ក្រសួងកំណត់យកថ្ងៃទី ២៧ ខែធ្នូ ជាថ្ងៃប្រឡងបាក់ឌុបទូទាំងប្រទេស ឯទម្រង់ប្រឡងដូចរាល់ឆ្នាំគ្មានប្ដូរ...",
        badge: "បាក់ឌុប២០២១",
        badgeColor: "#555",
    },
    {
        image: Img2,
        title: "ប្រយ័ត្នចាញ់បោកគេប្អូនៗ! ក្រសួងបដិសេធគ្មានកម្មវិធីអាហារូបករណ៍ពី«សមាគមស្ត្រីដើម្បីសង្គម» នោះទេ",
        des: "ប្រយ័ត្នចាញ់បោកគេប្អូនៗ! ក្រសួងបដិសេធគ្មានកម្មវិធីអាហារូបករណ៍ពី«សមាគមស្ត្រីដើម្បីសង្គម» នោះទេ...",
        badge: "បាក់ឌុប២០២១",
        badgeColor: "#555",
    },
    {
        image: Img3,
        title: "បែកធ្លាយសិស្សទី១២ បង្កើតគ្រុបដ៏ធំមួយជាង ៦ពាន់នាក់ សុំប្រមុខរដ្ឋាភិបាលជាប់បាក់ឌុបអូតូ តាមសារចម្លងបន្តគ្នាមួយនេះ",
        des: "បែកធ្លាយសិស្សទី១២ បង្កើតគ្រុបដ៏ធំមួយជាង ៦ពាន់នាក់ សុំប្រមុខរដ្ឋាភិបាលជាប់បាក់ឌុបអូតូ តាមសារចម្លងបន្តគ្នាមួយនេះ...",
        badge: "បាក់ឌុប២០២១",
        badgeColor: "#555",
    },
    {
        image: Img4,
        title: "ក្រសួងអប់រំ ច្រានចោលលិខិតក្លែងក្លាយផ្សព្វផ្សាយថា សិស្សប្រឡងសញ្ញាបត្របាក់ឌុប និងឌីប្លូម កំណត់ឲ្យជាប់ជាស្ថាពរ",
        des: "ក្រសួងអប់រំ ច្រានចោលលិខិតក្លែងក្លាយផ្សព្វផ្សាយថា សិស្សប្រឡងសញ្ញាបត្របាក់ឌុប និងឌីប្លូម កំណត់ឲ្យជាប់ជាស្ថាពរ...",
        badge: "បាក់ឌុប២០២១",
        badgeColor: "#555",
    },
    {
        image: Img5,
        title: "មុនបាក់ឌុបមកដល់ ក្រសួងអប់រំ ប្រកាសប្រឡងជ្រើសរើសគ្រូបង្រៀនកម្រិតអនុវិទ្យាល័យ តាមប្រព័ន្ធអនឡាញ",
        des: "មុនបាក់ឌុបមកដល់ ក្រសួងអប់រំ ប្រកាសប្រឡងជ្រើសរើសគ្រូបង្រៀនកម្រិតអនុវិទ្យាល័យ តាមប្រព័ន្ធអនឡាញ...",
        badge: "បាក់ឌុប២០២១",
        badgeColor: "#555",
    },
    {
        image: Img6,
        title: "តោះ មកដឹងវិធីសាស្ត្រអានសៀវភៅចប់បានច្រើនក្បាល ប្រើពេលតិច ងាយយល់ខ្លឹមសារ",
        des: "តោះ មកដឹងវិធីសាស្ត្រអានសៀវភៅចប់បានច្រើនក្បាល ប្រើពេលតិច ងាយយល់ខ្លឹមសារ...",
        badge: "បាក់ឌុប២០២១",
        badgeColor: "#555",
    },
    {
        image: Img7,
        title: " តិចអត់ដឹង! អ្នកជំនាញ ប្រាប់ថា កាហ្វេមានគុណប្រយោជន៍ណាស់ សម្រាប់មនុស្សស្ថិតក្នុងវ័យសិក្សា",
        des: " តិចអត់ដឹង! អ្នកជំនាញ ប្រាប់ថា កាហ្វេមានគុណប្រយោជន៍ណាស់ សម្រាប់មនុស្សស្ថិតក្នុងវ័យសិក្សា...",
        badge: "បាក់ឌុប២០២១",
        badgeColor: "#555",
    },
    {
        image: Img8,
        title: " មកដឹងវិធីសាស្ត្រទាំង ៥ អាចជួយអ្នកឱ្យក្រោកបានលឿនរហ័ស និងមិនងងុយពេលអង្គុយរៀនក្នុងថ្នាក់",
        des: " មកដឹងវិធីសាស្ត្រទាំង ៥ អាចជួយអ្នកឱ្យក្រោកបានលឿនរហ័ស និងមិនងងុយពេលអង្គុយរៀនក្នុងថ្នាក់...",
        badge: "បាក់ឌុប២០២១",
        badgeColor: "#555",
    },
];

export const mainBacIICategoryData: CategoryItem[] = [
    {
        image: MainImg1,
        title: "ផ្លូវការហើយ! ក្រសួងកំណត់យកថ្ងៃទី ២៧ ខែធ្នូ ជាថ្ងៃប្រឡងបាក់ឌុបទូទាំងប្រទេស ឯទម្រង់ប្រឡងដូចរាល់ឆ្នាំគ្មានប្ដូរ",
        des: "ផ្លូវការហើយ! ក្រសួងកំណត់យកថ្ងៃទី ២៧ ខែធ្នូ ជាថ្ងៃប្រឡងបាក់ឌុបទូទាំងប្រទេស ឯទម្រង់ប្រឡងដូចរាល់ឆ្នាំគ្មានប្ដូរ...",
        badge: "បាក់ឌុប២០២១",
        badgeColor: "#555",
    },
    {
        image: MainImg2,
        title: "ប្រយ័ត្នចាញ់បោកគេប្អូនៗ! ក្រសួងបដិសេធគ្មានកម្មវិធីអាហារូបករណ៍ពី«សមាគមស្ត្រីដើម្បីសង្គម» នោះទេ",
        des: "ប្រយ័ត្នចាញ់បោកគេប្អូនៗ! ក្រសួងបដិសេធគ្មានកម្មវិធីអាហារូបករណ៍ពី«សមាគមស្ត្រីដើម្បីសង្គម» នោះទេ...",
        badge: "បាក់ឌុប២០២១",
        badgeColor: "#555",
    },
];
