import { CategoryItem, MainCategoryItem } from '../../types';
import Img1 from '../../assets/category-images/covid19-category/img1.jpeg'
import Img2 from '../../assets/category-images/covid19-category/img2.jpeg'
import Img3 from '../../assets/category-images/covid19-category/img3.jpeg'
import Img4 from '../../assets/category-images/covid19-category/img4.png'
import Img5 from '../../assets/category-images/covid19-category/img5.jpeg'
import Img6 from '../../assets/category-images/covid19-category/img6.jpeg'
import Img7 from '../../assets/category-images/covid19-category/img7.png'
import Img8 from '../../assets/category-images/covid19-category/img8.jpeg'

import MainImg1 from '../../assets/category-images/main-category/main-covid19/main-img1.png'
import MainImg2 from '../../assets/category-images/main-category/main-covid19/main-img2.png'

export const covid19CategoryData = [
    {
        image: Img1,
        title: "ចេញ១រោងដំបូងជាមួយនាយពាក់មី​​ ទៅកំពង់ចាម លោក ហេរ៉ូ ស្រង៉ាកចិត្ដខ្លាំងណាស់!",
        des: "ចេញ១រោងដំបូងជាមួយនាយពាក់មី​​ ទៅកំពង់ចាម លោក ហេរ៉ូ ស្រង៉ាកចិត្ដខ្លាំងណាស់!...",
        badge: "Covid-19",
        badgeColor: "#ff0000",
    },
    {
        image: Img2,
        title: "បើករោងកុនលើកនេះ ហ៊ុយ យ៉ាឡេង ឈរលើគំនិតអភិវឌ្ឍន៍វិស័យភាពយន្ដខ្មែរមាំទាំណាស់!",
        des: "បើករោងកុនលើកនេះ ហ៊ុយ យ៉ាឡេង ឈរលើគំនិតអភិវឌ្ឍន៍វិស័យភាពយន្ដខ្មែរមាំទាំណាស់!...",
        badge: "Covid-19",
        badgeColor: "#ff0000",
    },
    {
        image: Img3,
        title: "អ្នកនិព្ធបទ”ស៊ូឃ្លាត” អ៊ឹម រតនា ទម្លាយអាការៈឆ្លងកូវីដ-១៩ថាខ្វះតែ២៤ម៉ោងអាចនឹងរុំក្នុងស្បោងប្លាស្ទិច",
        des: "អ្នកនិព្ធបទ”ស៊ូឃ្លាត” អ៊ឹម រតនា ទម្លាយអាការៈឆ្លងកូវីដ-១៩ថាខ្វះតែ២៤ម៉ោងអាចនឹងរុំក្នុងស្បោងប្លាស្ទិច...",
        badge: "Covid-19",
        badgeColor: "#ff0000",
    },
    {
        image: Img4,
        title: "ចាប់ពីពេលនេះទៅអ្នកជំងឺកូវីដ ពេលព្យាបាលជាហើយ អាចចេញទៅផ្ទះបានមិនបាច់ធ្វើចត្តាឡីស័កទៀតទេ",
        des: "ចាប់ពីពេលនេះទៅអ្នកជំងឺកូវីដ ពេលព្យាបាលជាហើយ អាចចេញទៅផ្ទះបានមិនបាច់ធ្វើចត្តាឡីស័កទៀតទេ...",
        badge: "Covid-19",
        badgeColor: "#ff0000",
    },
    {
        image: Img5,
        title: "ចាប់ពីពេលនេះទៅគ្មានការបិទសាលា បិទផ្សារ បិទរោងចក្រទៀតទេ មានករណីឆ្លងដឹកតែអ្នកជំងឺទៅព្យាបាលប៉ុណ្ណោះ",
        des: "ចាប់ពីពេលនេះទៅគ្មានការបិទសាលា បិទផ្សារ បិទរោងចក្រទៀតទេ មានករណីឆ្លងដឹកតែអ្នកជំងឺទៅព្យាបាលប៉ុណ្ណោះ...",
        badge: "Covid-19",
        badgeColor: "#ff0000",
    },
    {
        image: Img6,
        title: "តួលេខថ្មីប្រកាសថ្ងៃនេះ កាន់តែចុះទាបខ្លាំង ស្របពេលកម្ពុជាប្រកាសត្រៀមបើកប្រទេសឡើងវិញលើគ្រប់វិស័យ",
        des: "តួលេខថ្មីប្រកាសថ្ងៃនេះ កាន់តែចុះទាបខ្លាំង ស្របពេលកម្ពុជាប្រកាសត្រៀមបើកប្រទេសឡើងវិញលើគ្រប់វិស័យ...",
        badge: "Covid-19",
        badgeColor: "#ff0000",
    },
    {
        image: Img7,
        title: "បើកឆាកចូលរៀនថ្ងៃដំបូង ក្រោយត្រឡប់ពីភ្ជុំវិញ រកឃើញសិស្ស និងគ្រូច្រើននាក់ឆ្លងកូវីដ",
        des: "បើកឆាកចូលរៀនថ្ងៃដំបូង ក្រោយត្រឡប់ពីភ្ជុំវិញ រកឃើញសិស្ស និងគ្រូច្រើននាក់ឆ្លងកូវីដ...",
        badge: "Covid-19",
        badgeColor: "#ff0000",
    },
    {
        image: Img8,
        title: "អភិបាលខេត្តសៀមរាប រៀបរាប់ពីបទពិសោធដ៏ក្ដុកក្ដួល ក្នុងរយៈពេលបិទខ្ទប់ក្រុង និងស្រុកមួយចំនួននៅសៀមរាប",
        des: "អភិបាលខេត្តសៀមរាប រៀបរាប់ពីបទពិសោធដ៏ក្ដុកក្ដួល ក្នុងរយៈពេលបិទខ្ទប់ក្រុង និងស្រុកមួយចំនួននៅសៀមរាប...",
        badge: "Covid-19",
        badgeColor: "#ff0000",
    },
];

export const mainCovid19CategoryData = [
    {
        image: MainImg1,
        title: "ក្រសួងសុខាភិបាល សម្រេចអនុញ្ញាតឲ្យប្រើប្រាស់វ៉ាក់សាំងឈ្មោះ COVAXIN",
        des: "ក្រសួងសុខាភិបាល សម្រេចអនុញ្ញាតឲ្យប្រើប្រាស់វ៉ាក់សាំងឈ្មោះ COVAXIN...",
        badge: "Covid-19",
        badgeColor: "#ff0000",
    },
    {
        image: MainImg2,
        title: "ទីបំផុត កម្ពុជាប្រកាសអនុញ្ញាតឱ្យប្រើថ្នាំគ្រាប់ព្យាបាលជំងឺកូវីដ១៩",
        des: "ទីបំផុត កម្ពុជាប្រកាសអនុញ្ញាតឱ្យប្រើថ្នាំគ្រាប់ព្យាបាលជំងឺកូវីដ១៩...",
        badge: "Covid-19",
        badgeColor: "#ff0000",
    }
];
