import Img1 from '../../assets/category-images/deals-category/img1.jpeg'
import Img2 from '../../assets/category-images/deals-category/img2.jpeg'
import Img3 from '../../assets/category-images/deals-category/img3.jpeg'
import Img4 from '../../assets/category-images/deals-category/img4.jpeg'
import Img5 from '../../assets/category-images/deals-category/img5.jpeg'
import Img6 from '../../assets/category-images/deals-category/img6.jpeg'
import Img7 from '../../assets/category-images/deals-category/img7.jpeg'
import Img8 from '../../assets/category-images/deals-category/img8.jpeg'

import MainImg1 from '../../assets/category-images/main-category/main-deals/main-img1.jpeg'
import MainImg2 from '../../assets/category-images/main-category/main-deals/main-img2.jpeg'

export const dealsCategoryData = [
    {
        image: Img1,
        title: "ឡើងកូដកាន់តែខ្លាំង ផ្លូវជាតិលេខ ៦A លេចចេញរូបរាងផ្សារទំនើបថ្មីមួយទៀត",
        des: "ឡើងកូដកាន់តែខ្លាំង ផ្លូវជាតិលេខ ៦A លេចចេញរូបរាងផ្សារទំនើបថ្មីមួយទៀត...",
        badge: "DEALS",
        badgeColor: "#ff0000",
    },
    {
        image: Img2,
        title: "Halloween ឆ្នាំ ២០២១មានគម្រោងនៅ? សប្បាយៗ ចំណាយតិច ជាមួយគ្រួសារ",
        des: "Halloween ឆ្នាំ ២០២១មានគម្រោងនៅ? សប្បាយៗ ចំណាយតិច ជាមួយគ្រួសារ...",
        badge: "DEALS",
        badgeColor: "#ff0000",
    }, 
    {
        image: Img3,
        title: "ប្រូម៉ូសិនម៉ាអេម! បង់រំលស់ ១០០% ត្រឹមតែជាង ១ពាន់ដុល្លារអាមេរិកក្នុងមួយខែ",
        des: "ប្រូម៉ូសិនម៉ាអេម! បង់រំលស់ ១០០% ត្រឹមតែជាង ១ពាន់ដុល្លារអាមេរិកក្នុងមួយខែ...",
        badge: "DEALS",
        badgeColor: "#ff0000",
    },
    {
        image: Img4,
        title: "ទទួលការញ្ចុះតម្លៃ 3 ដុល្លារភ្លាមៗពេលអ្នកកុម្មង់អាហារតាមដៃគូ គ្រាន់តែប្រើកាត ABA Visa",
        des: "ទទួលការញ្ចុះតម្លៃ 3 ដុល្លារភ្លាមៗពេលអ្នកកុម្មង់អាហារតាមដៃគូ គ្រាន់តែប្រើកាត ABA Visa...",
        badge: "DEALS",
        badgeColor: "#ff0000",
    },
    {
        image: Img5,
        title: "អស់​បារម្ភ! ផ្សារ​ទំនើប​ ​អុីអន ម៉ល សែន​សុខ ​ស៊ីធី អនុវត្ត​វិធាន​ការ​​យ៉ាង​ខ្ជាប់​ខ្ជូន",
        des: "អស់​បារម្ភ! ផ្សារ​ទំនើប​ ​អុីអន ម៉ល សែន​សុខ ​ស៊ីធី អនុវត្ត​វិធាន​ការ​​យ៉ាង​ខ្ជាប់​ខ្ជូន...",
        badge: "DEALS",
        badgeColor: "#ff0000",
    },
    {
        image: Img6,
        title: "តើបានបុណ្យដូចគ្នា ឬអត់? រវាងម្ហូបស្រាប់ និងម្ហូបធ្វើខ្លួនឯង",
        des: "តើបានបុណ្យដូចគ្នា ឬអត់? រវាងម្ហូបស្រាប់ និងម្ហូបធ្វើខ្លួនឯង...",
        badge: "DEALS",
        badgeColor: "#ff0000",
    },
    {
        image: Img7,
        title: "តើត្រូវថែរក្សាស្បែកមុខបែបណាឱ្យមានសុខភាពល្អ និងនៅក្មេងជាងវ័យ?",
        des: "តើត្រូវថែរក្សាស្បែកមុខបែបណាឱ្យមានសុខភាពល្អ និងនៅក្មេងជាងវ័យ?...",
        badge: "DEALS",
        badgeColor: "#ff0000",
    },
    {
        image: Img8,
        title: "អត្រាការប្រាក់រហូតដល់ ៦.២៥%ក្នុងមួយឆ្នាំ! គិតគូរសន្សំប្រាក់ឱ្យចំណេញ",
        des: "អត្រាការប្រាក់រហូតដល់ ៦.២៥%ក្នុងមួយឆ្នាំ! គិតគូរសន្សំប្រាក់ឱ្យចំណេញ...",
        badge: "DEALS",
        badgeColor: "#ff0000",
    },
];

export const mainDealCategoryData = [
    {
        image: MainImg1,
        title: "មិនចាំបាច់​មាន​ប្រាក់កក់! បុរី ភូមិសាគូរ៉ា ដែលស្ថិតក្នុងទីតាំងមាន​សក្តានុពលខ្ពស់ បញ្ចុះ​តម្លៃ​ពិសេស និង​អាច​រំលស់បាន ១០០%",
        des: "មិនចាំបាច់​មាន​ប្រាក់កក់! បុរី ភូមិសាគូរ៉ា ដែលស្ថិតក្នុងទីតាំងមាន​សក្តានុពលខ្ពស់ បញ្ចុះ​តម្លៃ​ពិសេស និង​អាច​រំលស់បាន ១០០%....",
        badge: "DEALS",
        badgeColor: "#ff0000",
    },
    {
        image: MainImg2,
        title: "ចាំអីទៀត! ប្រម៉ូសិនកប់ៗ ជាមួយនឹងផលិតផលបែបធម្មជាតិ Think Nature ពីប្រទេសកូរ៉េ",
        des: "ចាំអីទៀត! ប្រម៉ូសិនកប់ៗ ជាមួយនឹងផលិតផលបែបធម្មជាតិ Think Nature ពីប្រទេសកូរ៉េ...",
        badge: "DEALS",
        badgeColor: "#ff0000",
    },
];