import { CategoryItem, MainCategoryItem } from '../../types';
import Img1 from '../../assets/category-images/life-category/img1.png'
import Img2 from '../../assets/category-images/life-category/img2.png'
import Img3 from '../../assets/category-images/life-category/img3.png'
import Img4 from '../../assets/category-images/life-category/img4.png'
import Img5 from '../../assets/category-images/life-category/img5.jpeg'
import Img6 from '../../assets/category-images/life-category/img6.jpeg'
import Img7 from '../../assets/category-images/life-category/img7.jpeg'
import Img8 from '../../assets/category-images/life-category/img8.jpeg'

import MainImg1 from '../../assets/category-images/main-category/main-life/main-img1.jpeg'
import MainImg2 from '../../assets/category-images/main-category/main-life/main-img2.jpeg'

export const lifeCategoryData: CategoryItem[] = [
    {
        image: Img1,
        title: "កំណត់ផ្លូវនេះ ត្រូវផ្អាកធ្វើចរាចរណ៍បណ្តោះអាសន្ន ក្នុងពិធីសម្ពោធអគារទីស្ដីការ",
        des: "កំណត់ផ្លូវនេះ ត្រូវផ្អាកធ្វើចរាចរណ៍បណ្តោះអាសន្ន ក្នុងពិធីសម្ពោធអគារទីស្ដីការ...",
        badge: "ជីវិតនិងសង្គម",
        badgeColor: "#f9a72b",
    },
    {
        image: Img2,
        title: "ព្រះបាទត្រសក់ផ្អែម ពីកសិករដាំត្រសក់ ឡើងសោយរាជ្យជាស្តេចផែនដី",
        des: "ព្រះបាទត្រសក់ផ្អែម ពីកសិករដាំត្រសក់ ឡើងសោយរាជ្យជាស្តេចផែនដី...",
        badge: "ជីវិតនិងសង្គម",
        badgeColor: "#f9a72b",
    },
    {
        image: Img3,
        title: "ទីបំផុត កម្ពុជាប្រកាសអនុញ្ញាតឱ្យប្រើថ្នាំគ្រាប់ព្យាបាលជំងឺកូវីដ១៩ មួយប្រភេទរបស់អាមេរិក",
        des: "ទីបំផុត កម្ពុជាប្រកាសអនុញ្ញាតឱ្យប្រើថ្នាំគ្រាប់ព្យាបាលជំងឺកូវីដ១៩ មួយប្រភេទរបស់អាមេរិក...",
        badge: "ជីវិតនិងសង្គម",
        badgeColor: "#f9a72b",
    },
    {
        image: Img4,
        title: "[Podcast] លោក លាង សុីកន រៀបរាប់ដំណើរដើមទង មុនក្លាយជាសិល្បករ ផ្នែកគំនូរសហសម័យ",
        des: "[Podcast] លោក លាង សុីកន រៀបរាប់ដំណើរដើមទង មុនក្លាយជាសិល្បករ ផ្នែកគំនូរសហសម័យ...",
        badge: "ជីវិតនិងសង្គម",
        badgeColor: "#f9a72b",
    },
    {
        image: Img5,
        title: "សហគ្រិនឆ្នើម២រូប ក្នុងវិស័យអប់រំដូចគ្នា ជួបគ្នាក្នុងវេទិកាតែមួយ ត្រៀមចែករំលែកបទពិសោធល្អៗ",
        des: "ថ្សហគ្រិនឆ្នើម២រូប ក្នុងវិស័យអប់រំដូចគ្នា ជួបគ្នាក្នុងវេទិកាតែមួយ ត្រៀមចែករំលែកបទពិសោធល្អៗ...",
        badge: "ជីវិតនិងសង្គម",
        badgeColor: "#f9a72b",
    },
    {
        image: Img6,
        title: "ថៃប្រកាសបើកឱ្យចូលវិញក៏មានប្រទេសកម្ពុជាដែរ មិនចាំបាច់ធ្វើចត្តាឡីស័ក",
        des: "ថ្ថៃប្រកាសបើកឱ្យចូលវិញក៏មានប្រទេសកម្ពុជាដែរ មិនចាំបាច់ធ្វើចត្តាឡីស័ក៌...",
        badge: "ជីវិតនិងសង្គម",
        badgeColor: "#f9a72b",
    },
    {
        image: Img7,
        title: "មិនភ័យផុងខ្លួនជំពាក់គេវ័នក! គោល​ដៅ​កម្ចី ៥​ប្រភេទ​​ល្អបំផុត​ អាច​នាំ​ឲ្យ​គ្រួសារ​មាន​ភាព​រីកចម្រើន",
        des: "ថ្វីត្បិតថាមានសញ្ជាតិផ្សេងពីកម្ពុជាមែនពិត ប៉ុន្តែទំហំក្ដីស្រលាញ់វប្បធម៌...",
        badge: "ជីវិតនិងសង្គម",
        badgeColor: "#f9a72b",
    },
    {
        image: Img8,
        title: "ប្រសើរឡើងៗ! តួលេខឆ្លងកូវីដចុងក្រោយនៅកម្ពុជាថយចុះយ៉ាងគំហុក ឯអ្នកស្លាប់ថ្មីភាគច្រើន",
        des: "ប្រសើរឡើងៗ! តួលេខឆ្លងកូវីដចុងក្រោយនៅកម្ពុជាថយចុះយ៉ាងគំហុក ឯអ្នកស្លាប់ថ្មីភាគច្រើន...",
        badge: "ជីវិតនិងសង្គម",
        badgeColor: "#f9a72b",
    },    
];

export const mainLifeCategoryData: CategoryItem[] = [
    {
        image: MainImg1,
        title: "Sabay បន្តបេសកកម្មយ៉ាងរឹងមាំ ផ្ដល់ជូនអ្នកទស្សនានូវមាតិកាដ៏សម្បូរបែប",
        des: "Sabay បន្តបេសកកម្មយ៉ាងរឹងមាំ ផ្ដល់ជូនអ្នកទស្សនានូវមាតិកាដ៏សម្បូរបែប...",
        badge: "ជីវិតនិងសង្គម",
        badgeColor: "#f9a72b",
    },
    {
        image: MainImg2,
        title: "ក្លិបនិស្សិត CamEd ​រៀប​ចំ​កិច្ច​ពិភាក្សា ដើម្បី​ជំ​រុញ​ឲ្យ​យុវ​ជន​កម្ពុជា ប្រើ​បណ្តាញ​សង្គម​បែប​វិជ្ជ​មាន",
        des: "ក្លិបនិស្សិត CamEd ​រៀប​ចំ​កិច្ច​ពិភាក្សា ដើម្បី​ជំ​រុញ​ឲ្យ​យុវ​ជន​កម្ពុជា ប្រើ​បណ្តាញ​សង្គម​បែប​វិជ្ជ​មាន...",
        badge: "ជីវិតនិងសង្គម",
        badgeColor: "#f9a72b",
    },
];
