import Img1 from '../assets/feature-images/img1.jpeg';
import Img2 from '../assets/feature-images/img2.jpeg';
import Img3 from '../assets/feature-images/img3.jpeg';
import Img4 from '../assets/feature-images/img4.jpeg';
import { FeatureItem } from '../types';

export const featureData: FeatureItem[] = [
  {
    image: Img1,
    title: 'ឡាន Honda Civic Si ឆ្នាំ២០២២ ជិះ១០០គ.ម ស៊ីសាំង៦លីត្រ ដាក់លក់តម្លៃជាង ២ម៉ឺនដុល្លារ',
    badge: 'បច្ចេកវិទ្យា',
    badgeColor: '#38c378',
    des: 'ក្រុមហ៊ុន Honda USA បានប្រកាសថា រថយន្ត Civic Si ស៊េរីឆ្នាំ២០២២...',
    date: 'ថ្ងៃនេះ ម៉ោង 09:59',
    width: '60%',
  },
  {
    image: Img2,
    title: 'តិច​ថា​លំ​ៗ ខៀវ សានសាណា ត្រូវ​ជ្រើសរើស​ជា​ពិធីការិនី​ឲ្យ UN យ៉ាង​កម្រ',
    badge: 'កម្សាន្ត',
    badgeColor: '#f95380',
    des: 'ពិធីការិនី និង​ជា​អ្នក​ផលិតកម្ម​វិធី​ទូរទស្សន៍ ខៀវ សានសាណា...',
    date: 'ថ្ងៃនេះ ម៉ោង 09:59',
    width: '40%',
  },
  {
    image: Img3,
    title:
      'ក្រុមហ៊ុនសម្រស់ធម្មជាតិ ឧបត្ថម្ភ​ប្រាក់​១០០០ដុល្លារ​​ និង​ចូលរួម​ក្នុង​យុទ្ធនាការ «រួមគ្នាដើម្បីព្យាបាលដំបៅផែនដី»',
    badge: 'ជីវិតនិងសង្គម',
    badgeColor: '#f9a72b',
    des: '​​​ថ្មីៗនេះ អ្នកនាង លាស់ រ័ត្នចិន្តា ដែលជាតំណាងធំរបស់ក្រុមហ៊ុនសម្រស់ធម្មជាតិ​...',
    date: 'ថ្ងៃនេះ ម៉ោង 09:59',
    width: '60%',
  },
  {
    image: Img4,
    title:
      'Facebook នឹងលែងមាន auto tag និងមិនអាចសម្គាល់មុខដឹងទៀតទេពេលគេបង្ហោះ រូប/វីដេអូ របស់យើង',
    badge: 'បច្ចេកវិទ្យា',
    badgeColor: '#38c378',
    des: 'ក្រុមហ៊ុន Meta (Facebook) បានធ្វើឱ្យមានការភ្ញាក់ផ្អើលដោយ...',
    date: 'ថ្ងៃនេះ ម៉ោង 09:59',
    width: '40%',
  },
];
